DataProcessors/КорректировкаРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КорректировкаРезервов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПоставщика</Name>
					<Comment>!не используется с 09 февраля 2016</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/КорректировкаРезервов/Ext/ObjectModule.bsl
Процедура КорректировкаРезервов() Экспорт
	
	//+Сёмин Р. 13.11.2025 #UT10-5422
	//выделил в отдельную функцию ПолучитьДанныеПоРезервамЗаказовПокупателей ниже 
	//ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	МАКСИМУМ(ВЫБОР
	//	|			КОГДА ЗаказыПокупателейОстатки.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя
	//	|				ТОГДА ВЫБОР
	//	|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|							ТОГДА ВЫБОР
	//	|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
	//	|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|								КОНЕЦ
	//	|						ИНАЧЕ ВЫБОР
	//	|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
	//	|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|							КОНЕЦ
	//	|					КОНЕЦ
	//	|			КОГДА &ЧислоДней <> 0
	//	|				ТОГДА ВЫБОР
	//	|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|							ТОГДА ВЫБОР
	//	|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
	//	|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, &ЧислоДней)
	//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, &ЧислоДней)
	//	|								КОНЕЦ
	//	|						ИНАЧЕ ВЫБОР
	//	|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
	//	|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, &ЧислоДней)
	//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, &ЧислоДней)
	//	|							КОНЕЦ
	//	|					КОНЕЦ
	//	|			ИНАЧЕ &Дата
	//	|		КОНЕЦ) КАК ОкончаниеРезерва,
	//	|	МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)) КАК ДатаРезерва
	//	|ПОМЕСТИТЬ ТаблицаРезервов
	//	|ИЗ
	//	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ) КАК ЗаказыПокупателейОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ) КАК ТоварыВСборкеОстатки
	//	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
	//	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , ) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
	//	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва
	//	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура
	//	|ГДЕ
	//	|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
	//	|	И ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	//	|	И ТоварыВСборкеОстатки.СобраноОстаток ЕСТЬ NULL
	//	|	И ТоварыВСборкеОстатки.КСборкеОстаток ЕСТЬ NULL
	//	|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//	|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата > &ДатаНач
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЗаказыПокупателейОстатки.ЗаказПокупателя
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТаблицаРезервов.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	ТаблицаРезервов.ОкончаниеРезерва КАК ОкончаниеРезерва
	//	|ИЗ
	//	|	ТаблицаРезервов КАК ТаблицаРезервов
	//	|ГДЕ
	//	|	ТаблицаРезервов.ОкончаниеРезерва < &Дата
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ОкончаниеРезерва";
	//
	//Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	//Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата(), -3));
	//Запрос.УстановитьПараметр("ЧислоДней", ЧислоДней);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	
	РезультатПакетаЗапросов = ПолучитьДанныеПоРезервамЗаказовПокупателей();
	РезультатЗапроса = РезультатПакетаЗапросов[1];
	//-Сёмин Р. 13.11.2025 #UT10-5422
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 		
		
		ОбщаяТаблица = Новый ТабличныйДокумент;
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокОбъект = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
			ДокОбъект.Заполнить(Выборка.ЗаказПокупателя);
			ДокОбъект.КорректировкаГМИзСтороннегоФилиала = Выборка.ЗаказПокупателя.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала;
			ДокОбъект.Комментарий = "Создан регламентным заданием по корректировке резервов " + Формат(ТекущаяДата(), "ДЛФ=DT") + "";
			
			Для Каждого Стр Из ДокОбъект.Товары Цикл
				Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ИстекСрокРезервирования; 
			КонецЦикла;
			
			ДокОбъект.Дата = ТекущаяДата();
			
			Если ДокОбъект.Товары.Количество() Тогда
				
				Попытка
					
					ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
				Исключение
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПоРезервамЗаказовПокупателей(ЗаказПокупателя = Неопределено) Экспорт
	//+Сёмин Р. 12.11.2025 #UT10-5422
	
	ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказыПокупателейОстатки.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя
		|				ТОГДА ВЫБОР
		|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОГДА &ЧислоДней <> 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, &ЧислоДней)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, &ЧислоДней)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, &ЧислоДней)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, &ЧислоДней)
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ &Дата
		|		КОНЕЦ) КАК ОкончаниеРезерва,
		|	МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)) КАК ДатаРезерва
		|ПОМЕСТИТЬ ТаблицаРезервов
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(, #УсловиеЗаказыПокупателейОстатки) КАК ЗаказыПокупателейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, #УсловиеТоварыВСборкеОстатки) КАК ТоварыВСборкеОстатки
		|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , #УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
		|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва
		|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура
		|ГДЕ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
		|	И ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
		|	И ТоварыВСборкеОстатки.СобраноОстаток ЕСТЬ NULL
		|	И ТоварыВСборкеОстатки.КСборкеОстаток ЕСТЬ NULL
		|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
		|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата > &ДатаНач
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезервов.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРезервов.ОкончаниеРезерва КАК ОкончаниеРезерва
		|ИЗ
		|	ТаблицаРезервов КАК ТаблицаРезервов
		|ГДЕ
		|	ТаблицаРезервов.ОкончаниеРезерва < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОкончаниеРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезервов.ЗаказПокупателя,
		|	ТаблицаРезервов.ОкончаниеРезерва,
		|	ТаблицаРезервов.ДатаРезерва
		|ИЗ
		|	ТаблицаРезервов КАК ТаблицаРезервов";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата(), -3));
	Запрос.УстановитьПараметр("ЧислоДней", ЧислоДней);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗаказыПокупателейОстатки", "ЗаказПокупателя = &ЗаказПокупателя");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВСборкеОстатки", "ЗаказПокупателя = &ЗаказПокупателя");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты", "ДокументРезерва = &ЗаказПокупателя");
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗаказыПокупателейОстатки", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВСборкеОстатки", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты", "");
		
	КонецЕсли;
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	Возврат РезультатПакетаЗапросов;
	
	//-Сёмин Р. 12.11.2025 #UT10-5422
КонецФункции

Функция ПолучитьДанныеПоРезервуЗаказаНеИзРегистра(ЗаказПокупателя) Экспорт
	
	//+Сёмин Р.И. 06.03.2026 #UT10-5726
	ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	ДатаРезерва = НачалоДня(ТекущаяДата());
	
	Если ЗаказПокупателя.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗаказПокупателя.ДатаОтгрузки) Тогда
			ДатаРезерва = ЗаказПокупателя.Дата + ЗаказПокупателя.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты * 60 * 60 * 24;
		Иначе
			ДатаРезерва = ЗаказПокупателя.ДатаОтгрузки + ЗаказПокупателя.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты * 60 * 60 * 24;
		КонецЕсли;
		
	ИначеЕсли ЧислоДней <> 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗаказПокупателя.ДатаОтгрузки) Тогда
			ДатаРезерва = ЗаказПокупателя.Дата + ЧислоДней * 60 * 60 * 24;
		Иначе
			ДатаРезерва = ЗаказПокупателя.ДатаОтгрузки + ЧислоДней * 60 * 60 * 24;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДатаРезерва;
	//-Сёмин Р.И. 06.03.2026 #UT10-5726
	
КонецФункции
